Revit 2027 API
ParameterTypeId.DimStyleCenterlinePattern Property
 "Centerline Pattern"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId DimStyleCenterlinePattern { get; }
Public Shared ReadOnly Property DimStyleCenterlinePattern As ForgeTypeId
	Get
public:
static property ForgeTypeId^ DimStyleCenterlinePattern {
	ForgeTypeId^ get ();
}
static member DimStyleCenterlinePattern : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace